Ran Plan for dir: `deployment/cloud` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # kubectl_manifest.manifests will be created
+ resource "kubectl_manifest" "manifests" {
      + api_version             = "cert-manager.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterIssuer"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "letsencrypt-fta"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: cert-manager.io/v1
            kind: ClusterIssuer
            metadata:
              name: letsencrypt-fta
            spec:
              acme:
                email: imamariefrahmann@gmail.com
                privateKeySecretRef:
                  name: letsencrypt-fta
                server: https://acme-v02.api.letsencrypt.org/directory
                solvers:
                - http01:
                    ingress:
                      class: nginx
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.cert_manager.helm_release.helm will be created
+ resource "helm_release" "helm" {
      + atomic                     = false
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = true
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "fta-helm-cert-manager"
      + namespace                  = "cert-manager"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (sensitive value)
      + verify                     = false
      + version                    = "v1.15.3"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.cert_manager.kubernetes_namespace.namespace[0] will be created
+ resource "kubernetes_namespace" "namespace" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "cert-manager"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d deployment/cloud
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://fta-mstr-gce-atlantis:4141/lock?id=greyhats13%252Ffta_iac%252Fdeployment%252Fcloud%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d deployment/cloud
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```